_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_БлокировкиСметныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_БлокировкиСметныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникБлокировки</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаблокированныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/СМ_СметаБлокировкиВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сметная подсистема".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет наличие блокировок другими пользоателями.
//
// Параметры:
//     Ссылка 				 - 	Ссылка - любая ссылка на объект, блокировка которого проверяется.
//     ГлТекущийПользователь - 	СправочникСсылка.Пользователи - ссылка на текущего пользователя.
//
// Возвращаемое значение:
// 	   Стуктура - содержит поля:
//			* Заблокирован - Булево - Заблокирован ли объект.
//			* Пользователь - СправочникСсылка.Пользователи - Кем Заблокирован объект.
//			* Источник     - ДокументСсылка, СправочникСсылка - Объект, инициирующий блокировку.
//		    Или Ложь в случае отсутствия блокировок.
//
Функция ОбъектЗаблокирован(Ссылка, глТекущийПользователь) Экспорт
	
	Набор = РегистрыСведений.СМ_БлокировкиСметныхДокументов.СоздатьНаборЗаписей();
	Набор.Отбор.ЗаблокированныйОбъект.Установить(Ссылка);
	Набор.Прочитать();
	Если Набор.Количество()>0 Тогда
		Возврат Новый Структура("Заблокирован, Пользователь, Источник", Набор[0].Заблокирован, Набор[0].Пользователь,  Набор[0].ИсточникБлокировки);	
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

// Устанавливает блокировку текущим пользователем.
//
// Параметры:
//     БлокируемаяСсылка - ДокументСсылка, СправочникСсылка - ссылка на объект, блокировка которого устанавливается.
//     СсылкаИсточник  	 - ДокументСсылка, СправочникСсылка - причина блокировки (ссылка на объект источник).
//
// Возвращаемое значение:
//     Булево - Истина - блокировка установлена, Ложь - в противном случае.
//
Функция УстановитьБлокировку(БлокируемаяСсылка, СсылкаИсточник) Экспорт
	
	Набор = РегистрыСведений.СМ_БлокировкиСметныхДокументов.СоздатьНаборЗаписей();
	Набор.Отбор.ЗаблокированныйОбъект.Установить(БлокируемаяСсылка);
	Набор.Прочитать();
	Если Набор.Количество()>0 Тогда
		Возврат Новый Структура("Заблокирован, Пользователь, Источник", Набор[0].Заблокирован, Набор[0].Пользователь,  Набор[0].ИсточникБлокировки);	
	Иначе
		Запись = Набор.Добавить();
		Запись.ЗаблокированныйОбъект = БлокируемаяСсылка;
		Запись.Заблокирован = Истина;
		Запись.ИсточникБлокировки = СсылкаИсточник;
		Набор.Записать(Истина);
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти
